## Import Libraries

In [258]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import random as rnd

## Importing the dataset

In [259]:
train_df=pd.read_csv('train.csv')
test_df=pd.read_csv('test.csv')
combine=['train_df','test_df']

In [260]:
print(train_df.info())
print('-'*50)
print(test_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB
None

In [261]:
train_df.columns.values

array(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype=object)

## Analyzing the co-relation between survived and othe features

### Relation between Pclass and Survived

In [262]:
train_df[['Pclass','Survived']].groupby(['Pclass'],as_index=False).mean().sort_values(by='Survived',ascending=False)

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

### Relation between Sex and Survived

In [263]:
train_df[['Sex','Survived']].groupby(['Sex'],as_index=False).mean().sort_values(by='Survived',ascending=False)

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [264]:
train_df[['Embarked','Survived']].groupby(['Embarked'],as_index=False).mean().sort_values(by='Survived',ascending=False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.336957

## Its time to Clean the date

## First we will drop cabin and ticket

In [265]:

train_df=train_df.drop(['Cabin','Ticket'],axis=1)
test_df=test_df.drop(['Cabin','Ticket'],axis=1)
combine=[train_df,test_df]

## Extracting new feature from name feature

In [266]:
for dataset in combine:
    dataset['Title']=dataset['Name'].str.split(',',expand=True)[1].str.split('.',expand=True)[0]

In [267]:
train_df['Title'].value_counts()

 Mr              517
 Miss            182
 Mrs             125
 Master           40
 Dr                7
 Rev               6
 Mlle              2
 Major             2
 Col               2
 Lady              1
 the Countess      1
 Don               1
 Sir               1
 Mme               1
 Jonkheer          1
 Capt              1
 Ms                1
Name: Title, dtype: int64

In [268]:
test_df['Title'].value_counts()

 Mr        240
 Miss       78
 Mrs        72
 Master     21
 Rev         2
 Col         2
 Dr          1
 Dona        1
 Ms          1
Name: Title, dtype: int64

In [269]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q,Mr
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S,Mrs

In [270]:
Z=10
Train_title=(train_df['Title'].value_counts()<10)
train_df['Title']=train_df['Title'].apply(lambda x: "Misc" if Train_title.loc[x]==True else x)
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,Mr

In [271]:
Test_title=(test_df['Title'].value_counts()<10)
test_df['Title']=test_df['Title'].apply(lambda x: "Misc" if Test_title.loc[x]==True else x)
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,892,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q,Mr
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q,Mr
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S,Mr
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S,Mrs

In [272]:
train_df['Title'].value_counts()

 Mr        517
 Miss      182
 Mrs       125
 Master     40
Misc        27
Name: Title, dtype: int64

In [273]:
test_df['Title'].value_counts()

 Mr        240
 Miss       78
 Mrs        72
 Master     21
Misc         7
Name: Title, dtype: int64

In [274]:
train_df=train_df.drop(['Name','PassengerId'],axis=1)
test_df=test_df.drop(['Name'],axis=1)

In [275]:
train_df.shape,test_df.shape

((891, 9), (418, 9))

### Label Encoding the feature Sex,Title,Embarked

In [276]:
from sklearn.preprocessing import LabelEncoder
LE=LabelEncoder()
train_df['Sex']=LE.fit_transform(train_df['Sex'])

In [277]:
train_df['Title']=LE.fit_transform(train_df['Title'])

In [278]:
test_df['Sex']=LE.fit_transform(test_df['Sex'])

In [279]:
test_df['Title']=LE.fit_transform(test_df['Title'])

In [280]:
test_df['Embarked']=LE.fit_transform(test_df['Embarked'])

In [281]:
test_df.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Title
0          892       3    1  34.5      0      0   7.8292         1      2
1          893       3    0  47.0      1      0   7.0000         2      3
2          894       2    1  62.0      0      0   9.6875         1      2
3          895       3    1  27.0      0      0   8.6625         2      2
4          896       3    0  22.0      1      1  12.2875         2      3

In [282]:
train_df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

## Cleaning Data

In [283]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int64
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    889 non-null object
Title       891 non-null int64
dtypes: float64(2), int64(6), object(1)
memory usage: 62.7+ KB

In [284]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Sex            418 non-null int64
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Embarked       418 non-null int64
Title          418 non-null int64
dtypes: float64(2), int64(7)
memory usage: 29.5 KB

In [285]:
train_df['Age'].fillna(train_df['Age'].median(),inplace=True)

train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int64
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    889 non-null object
Title       891 non-null int64
dtypes: float64(2), int64(6), object(1)
memory usage: 62.7+ KB

In [286]:
train_df['Fare'].fillna(train_df['Fare'].median(),inplace=True)
train_df['Embarked'].fillna(train_df['Embarked'].mode()[0],inplace=True)

In [287]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int64
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null object
Title       891 non-null int64
dtypes: float64(2), int64(6), object(1)
memory usage: 62.7+ KB

In [288]:
train_df['Embarked']=LE.fit_transform(train_df['Embarked'])

In [289]:
train_df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Title
0         0       3    1  22.0      1      0   7.2500         2      2
1         1       1    0  38.0      1      0  71.2833         0      3
2         1       3    0  26.0      0      0   7.9250         2      1
3         1       1    0  35.0      1      0  53.1000         2      3
4         0       3    1  35.0      0      0   8.0500         2      2

In [290]:
test_df['Age'].fillna(test_df['Age'].median(),inplace=True)
test_df['Fare'].fillna(test_df['Fare'].median(),inplace=True)
test_df['Embarked'].fillna(test_df['Embarked'].mode()[0],inplace=True)
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Sex            418 non-null int64
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           418 non-null float64
Embarked       418 non-null int64
Title          418 non-null int64
dtypes: float64(2), int64(7)
memory usage: 29.5 KB

## Making the Age and Fare Band

In [291]:
train_df['Fare']=pd.qcut(train_df['Fare'],4)
test_df['Fare']=pd.qcut(test_df['Fare'],4)
train_df['Age']=pd.cut(train_df['Age'],5)
test_df['Age']=pd.cut(test_df['Age'],5)

In [292]:
train_df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,0,3,1,"(16.336, 32.252]",1,0,"(-0.001, 7.91]",2,2
1,1,1,0,"(32.252, 48.168]",1,0,"(31.0, 512.329]",0,3
2,1,3,0,"(16.336, 32.252]",0,0,"(7.91, 14.454]",2,1
3,1,1,0,"(32.252, 48.168]",1,0,"(31.0, 512.329]",2,3
4,0,3,1,"(32.252, 48.168]",0,0,"(7.91, 14.454]",2,2

In [293]:
train_df['Age']=LE.fit_transform(train_df['Age'])
train_df.head()

   Survived  Pclass  Sex  Age  SibSp  Parch             Fare  Embarked  Title
0         0       3    1    1      1      0   (-0.001, 7.91]         2      2
1         1       1    0    2      1      0  (31.0, 512.329]         0      3
2         1       3    0    1      0      0   (7.91, 14.454]         2      1
3         1       1    0    2      1      0  (31.0, 512.329]         2      3
4         0       3    1    2      0      0   (7.91, 14.454]         2      2

In [294]:
train_df['Fare']=LE.fit_transform(train_df['Fare'])
train_df.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked  Title
0         0       3    1    1      1      0     0         2      2
1         1       1    0    2      1      0     3         0      3
2         1       3    0    1      0      0     1         2      1
3         1       1    0    2      1      0     3         2      3
4         0       3    1    2      0      0     1         2      2

In [295]:
test_df['Fare']=LE.fit_transform(test_df['Fare'])
test_df['Age']=LE.fit_transform(test_df['Age'])

## Feature Engineering, Creating New Feature

In [296]:
train_df['FamilySize']=train_df['SibSp']+train_df['Parch']+1
test_df['FamilySize']=test_df['SibSp']+test_df['Parch']+1

In [297]:
train_df['IsAlone']=1
test_df['IsAlone']=1

In [298]:
train_df['IsAlone'].loc[train_df['FamilySize']>1]=0
test_df['IsAlone'].loc[test_df['FamilySize']>1]=0

In [299]:
train_df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,FamilySize,IsAlone
0,0,3,1,1,1,0,0,2,2,2,0
1,1,1,0,2,1,0,3,0,3,2,0
2,1,3,0,1,0,0,1,2,1,1,1
3,1,1,0,2,1,0,3,2,3,2,0
4,0,3,1,2,0,0,1,2,2,1,1

In [300]:
test_df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,FamilySize,IsAlone
0,892,3,1,2,0,0,0,1,2,1,1
1,893,3,0,3,1,0,0,2,3,2,0
2,894,2,1,4,0,0,1,1,2,1,1
3,895,3,1,1,0,0,1,2,2,1,1
4,896,3,0,1,1,1,1,2,3,3,0

In [301]:
train_df['Age*Class']=train_df['Age']*train_df['Pclass']
test_df['Age*Class']=test_df['Age']*test_df['Pclass']

In [302]:
X_train = train_df.drop(['Survived','SibSp','Parch','FamilySize'], axis=1)
Y_train = train_df['Survived']
X_test  = test_df.drop(['PassengerId','SibSp','Parch','FamilySize'], axis=1).copy()
X_train.shape, Y_train.shape, X_test.shape

((891, 8), (891,), (418, 8))

# Its Modelling Time

In [304]:
X_train.head()

   Pclass  Sex  Age  Fare  Embarked  Title  IsAlone  Age*Class
0       3    1    1     0         2      2        0          3
1       1    0    2     3         0      3        0          2
2       3    0    1     1         2      1        1          3
3       1    0    2     3         2      3        0          2
4       3    1    2     1         2      2        1          6

In [305]:
Y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [306]:
X_test.head()

   Pclass  Sex  Age  Fare  Embarked  Title  IsAlone  Age*Class
0       3    1    2     0         1      2        1          6
1       3    0    3     0         2      3        0          9
2       2    1    4     1         1      2        1          8
3       3    1    1     1         2      2        1          3
4       3    0    1     1         2      3        0          3

## Modelling Start

In [307]:
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC,LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier

In [308]:
logreg=LogisticRegression()
logreg.fit(X_train,Y_train)
avv_logreg=round(logreg.score(X_train,Y_train)*100,2)
avv_logreg

/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

78.79

In [309]:
svc=SVC()
svc.fit(X_train,Y_train)
avv_svc=round(svc.score(X_train,Y_train)*100,2)
avv_svc

/anaconda3/lib/python3.7/site-packages/sklearn/svm/base.py:196: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

83.05

In [310]:
knn=KNeighborsClassifier()
knn.fit(X_train,Y_train)
avv_knn=round(knn.score(X_train,Y_train)*100,2)
avv_knn

84.29

In [312]:
gaus=GaussianNB()
gaus.fit(X_train,Y_train)
avv_gaus=round(gaus.score(X_train,Y_train)*100,2)
avv_gaus

76.21

In [313]:
percep = Perceptron()
percep.fit(X_train,Y_train)
avv_percep=round(percep.score(X_train,Y_train)*100,2)
avv_percep

/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/stochastic_gradient.py:166: FutureWarning: max_iter and tol parameters have been added in Perceptron in 0.19. If both are left unset, they default to max_iter=5 and tol=None. If tol is not None, max_iter defaults to max_iter=1000. From 0.21, default max_iter will be 1000, and default tol will be 1e-3.
  FutureWarning)

78.9

In [315]:
linear_svc=LinearSVC()
linear_svc.fit(X_train,Y_train)
avv_linear_svc=round(linear_svc.score(X_train,Y_train)*100,2)
avv_linear_svc

/anaconda3/lib/python3.7/site-packages/sklearn/svm/base.py:922: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  "the number of iterations.", ConvergenceWarning)

78.9

In [316]:
SGDC=SGDClassifier()
SGDC.fit(X_train,Y_train)
avv_SGDC=round(SGDC.score(X_train,Y_train)*100,2)
avv_SGDC

/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/stochastic_gradient.py:166: FutureWarning: max_iter and tol parameters have been added in SGDClassifier in 0.19. If both are left unset, they default to max_iter=5 and tol=None. If tol is not None, max_iter defaults to max_iter=1000. From 0.21, default max_iter will be 1000, and default tol will be 1e-3.
  FutureWarning)

67.0

In [318]:
decision_tree=DecisionTreeClassifier()
decision_tree.fit(X_train,Y_train)
avv_decision_tree=round(decision_tree.score(X_train,Y_train)*100,2)
avv_decision_tree

86.98

In [320]:
random_forest=RandomForestClassifier(n_estimators=100)
random_forest.fit(X_train,Y_train)
avv_random_forest=round(random_forest.score(X_train,Y_train)*100,2)
avv_random_forest

86.98

In [321]:
y_pred=random_forest.predict(X_test)

In [324]:
y_pred[0:5]

array([0, 0, 0, 0, 1])

# Submission of Final Result

In [326]:
Submission=pd.DataFrame({
    "PassengedId" : test_df['PassengerId'],
    "Survived" : y_pred
})

In [328]:
Submission.to_csv("/Users/trojan/Documents/Titanic Kaggle Predication/Submission.csv",index=False)